<?php
include "head.php";

?>
 <script src="https://cdn.jsdelivr.net/npm/chart.js"></script> <!--βιβλιοθηκη που δημιουργει γραφήματα--> 
<h1>Αριθμός Αιτημάτων/Προσφορών</h1> <!--τιτλος σελιδας--> 

<div>
<!--Δημιουργείται ένα στοιχείο <canvas> με το id="myChart" για την απεικόνιση του διαγράμματος. 
Το Chart.js θα χρησιμοποιήσει αυτό το στοιχείο για να δημιουργήσει το ραβδόγραμμα.--> 
  <canvas id="myChart"></canvas>
</div>

<script>
    //Ορίζεται μια σταθερά ctx η οποία παίρνει το <canvas> στοιχείο με το ID myChart από το HTML. Αυτό το στοιχείο θα χρησιμοποιηθεί για την απεικόνιση του γραφήματος.
  const ctx = document.getElementById('myChart');




//εκτελείται αίτημα στο phpcode.php?proc=200, το οποίο επιστρέφει τον αριθμό των αιτημάτων και προσφορών με διαφορετικές καταστάσεις.

//Το διάγραμμα που δημιουργειται δείχνει τις κατανομές αιτημάτων και προσφορών σε καταστάσεις "wait", "pedding", και το συνολικό πλήθος τους.

  $.getJSON("phpcode.php?proc=200",(res)=>{
   
   
    //Δημιουργία του Γραφήματος:
  new Chart(ctx, { //Δημιουργείται ένα νέο διάγραμμα χρησιμοποιώντας την κλάση Chart.Το ctx είναι το στοιχείο canvas
    type: 'bar', //ορίζει ότι το διάγραμμα θα είναι τύπου ραβδογράμματος (bar chart).
   
   //Ορισμός των Δεδομένων:
    data: {
        //labels: Οι ετικέτες στον άξονα x 
      labels: ['Αιτήματα Wait', 'Αιτήματα Pedding', 'Αιτηματα Συνολικά','Προσφορές Wait', 'Προσφορές Pedding', 'Προσφορές Συνολικά'],
      //datasets: Ορίζει τα δεδομένα που θα εμφανιστούν στο διάγραμμα
      datasets: [{
        label: '#',//Είναι η ετικέτα του dataset που εμφανίζεται στο γράφημα
        data: [res[0], res[1], res[2], res[3], res[4], res[5]], //data: Τα δεδομένα που αντλούνται από την απάντηση res του phpcode.php
        borderWidth: 1 //Ορίζει το πάχος των συνόρων των ράβδων στο διάγραμμα
      }]
    },
    options: { //Εδώ ορίζονται οι επιλογές μορφοποίησης του γραφήματος
      scales: {
        y: {
          beginAtZero: true //scales.y.beginAtZero: true: Ο άξονας y ξεκινάει από το 0
        }
      }
    }
  });
}
);
</script>
 


</body>
</html>
